# HostTopoId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Toposolid..::..HostTopoId Property
Toposolid Class See Also
---
The host toposolid id of the current toposolid subdivision. If the object is not a toposolid subdivision, hostTopoId will be InvalidElementId.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ElementId HostTopoId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HostTopoId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ HostTopoId {
	ElementId^ get ();
}
```

# See Also
Toposolid Class
Autodesk.Revit.DB Namespace